backend/test/stress/swarm-test.yml
config:
  target: http://localhost:8080
  phases:
    - duration: 60
      arrivalRate: 10
      name: warmup
    - duration: 120
      arrivalRate: 25
      rampTo: 100
      name: load-test
  plugins:
    expect:
      - response_time.p90: 300
      - errors.rate: 0.005
scenarios:
  - name: health-swarm
    weight: 40
    flow:
      - get:
          url: /health
  - name: contact-swarm
    weight: 40
    flow:
      - post:
          url: /contact
          json:
            name: swarm-test
            email: swarm@docker.com
            message: testing load balancer
  - name: health-timeout
    weight: 20
    flow:
      - get:
          url: /health
          timeout: 5